console.log("Завдання: 6 ==============================");

// Створюємо функцію task6, яка використовує setImmediate та проміси.
function task6() {
  new Promise((resolve, reject) => {
    setImmediate(() => {
    let num = Math.random(1);
      if(num < 0.5){
        resolve(console.log(`Більше ніж 0.5.`));
      } else {
        reject(console.log(`Менше ніж 0.5`));
      }
    })
  })    // Створюємо новий проміс.
  .then((value) => {
    resolve(console.log(`Проміс зарезолвився з значенням: ${value}`));
  })    // Використовуємо функцію setImmediate, щоб виконати функцію асинхронно.
  .catch((error) => {
    reject(console.log(`Проміс відхилився з помилкою: ${error}`))
  })    // Генеруємо випадкове число від 0 до 1
      // Якщо випадкове число менше 0.5, резолвимо проміс з рядком Більше ніж 0.5.
  .finally(() => {
    console.log("Проміс завершено");
  })    // Інакше відхиляемо проміс з рядком Менше ніж 0.5 .
      // Використовуємо then для обробки зарезолвленого проміса, та виводимо `Проміс зарезолвився з значенням: ${value}`.
      // Якщо проміс відхилено, обробляємо помилку за допомогою catch, та виводимо `Проміс відхилився з помилкою: ${error}`.
      // Використовуємо finally для виконання дій після завершення проміса, незалежно від його статусу, та виводимо "Проміс завершено".
}

// Викликаємо функцію task6
task6();
